Перем ОбедПользователя Экспорт;
Перем НачалоРаботы;
Перем КонецРаботы;
Перем ЭтоАдмин Экспорт;
Перем УИД экспорт;
Перем ВыбранОбед Экспорт;

Процедура ПриНачалеРаботыСистемы()
	ВыбранОбед = Истина;
	РаботаСДанными.СинхронизироватьПользователя(ЭтоАдмин, ВыбранОбед);
	РаботаСДанными.ПередатьАргументы(НачалоРаботы, КонецРаботы);
	ТекЧас = Час(ТекущаяДата());
	
		Если (ТекЧас < Час(НачалоРаботы) или ТекЧас > Час(КонецРаботы)+1) и ЭтоАдмин = Ложь Тогда
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОбработкаОповещения", ОбработчикиОповещений); 
			ПоказатьПредупреждение(ОписаниеОповещенияОЗавершении,"Твоё время еще не пришло");
			ОбработчикиОповещений.ЗакрытиеОкна();		
		ИначеЕсли ВыбранОбед = Ложь Тогда
		 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ВыбранОбед; 
			Сообщение.Сообщить();
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Новый Структура("ПометкаУдаления",Ложь));
			ПараметрыКонтекста = УИД;
			ОписаниеОповещенияОбОбеде = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормы", ОбработчикиОповещений, ВыбранОбед);
			ОткрытьФорму("Справочник.ВариантыОбедов.ФормаВыбора",ПараметрыФормы,,,,,
    		ОписаниеОповещенияОбОбеде,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ,  ТекстПредупреждения)
    Если Час(ТекущаяДата()) > Час(НачалоРаботы) и Час(ТекущаяДата()) < Час(КонецРаботы) и ЭтоАдмин = Ложь Тогда
		Отказ = Истина;
  		ТекстПредупреждения = "Вы закрываете приложение в рабочее время. Вы уверены?";
	КонецЕсли;
КонецПроцедуры
